/**
 *
 * File: kyranis_2B.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 23/1/2019
 * Time: 2:50 πμ
 *
 * ΥΠΟΕΡΓΑΣΙΑ 2Β
 *
 * Να γραφεί πρόγραμμα στη γλώσσα προγραμματισμού C, το οποίο να διαβάζει διαδοχικά 3
 * ακεραίους αριθμούς και να τους εισάγει σε μια απλά συνδεδεμένη λίστα. Να χρησιμοποιηθεί
 * αμυντικός προγραμματισμός ώστε ο πρώτος αριθμός να είναι στο διάστημα [-10,10], ενώ κάθε
 * επόμενος σε διάστημα ±10 από τον προηγούμενό του (π.χ. αν ο πρώτος αριθμός δοθεί 7, τότε ο
 * δεύτερος πρέπει να είναι στο διάστημα [-3,17]. Αν αντίστοιχα ο δεύτερος δοθεί -2, τότε ο τρίτος
 * πρέπει να είναι στο διάστημα [-12,8]). Στο τέλος να διατρέχει τη λίστα και να εκτυπώνει την
 * τιμή κάθε κόμβου, καθώς και το πλήθος των κόμβων με θετική τιμή.
 *
 */

#include <stdio.h>

int main()
{

}
