/**
 *
 * File: kyranis_2C.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 23/1/2019
 * Time: 2:49 πμ
 *
 * Σε ένα αγώνα άλμα εις μήκος συμμετέχουν 8 αθλητές. Να γραφεί πρόγραμμα στη γλώσσα
 * προγραμματισμού C, το οποίο να διαβάζει τον αριθμό φανέλας (ακέραιος, υποχρεωτικά στο
 * διάστημα 100-999) και την καλύτερη επίδοση (πραγματικός, υποχρεωτικά στο διάστημα 0.0-
 * 9.9) για όλους τους αθλητές, και στην συνέχεια να εμφανίζει την λίστα κατάταξης (δηλαδή
 * αριθμό και καλύτερη επίδοση ταξινομημένα σε φθίνουσα ταξινόμηση ως προς την επίδοση).
 * Για την αποθήκευση των δεδομένων να χρησιμοποιηθούν πίνακες, ενώ για την ταξινόμηση η
 * μέθοδος της φυσαλίδας. Για απλοποίηση της λύσης, δεν χρειάζεται να ελέγχεται με αμυντικό
 * προγραμματισμό αν δύο ή περισσότεροι αθλητές έχουν τον ίδιο αριθμό φανέλας.
 *
 */

#include <stdio.h>

int main()
{

}
