/**
 *
 * File: kyranis_1D.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 2019-01-21
 * Time: 23:02
 *
 * Για τον τριψήφιο ακέραιο αριθμό 145 ισχύει ότι ισούται με το άθροισμα των παραγοντικών των ψηφίων
 * του δηλ. 145=1! + 4! + 5!. Να γραφεί πρόγραμμα στη γλώσσα προγραμματισμού C, το οποίο με χρήση εξαντλητικής
 * αναζήτησης όλων των πενταψήφιων αριθμών να βρίσκει τον μοναδικό πενταψήφιο ακέραιο αριθμό που ισούται με το
 * άθροισμα των παραγοντικών των ψηφίων του.
 *
 */

#include <stdio.h>

int main()
{



    return 0;
}
