/**
 *
 * File: kyranis_1E.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 23/1/2019
 * Time: 1:20 πμ
 *
 * Να γραφεί πρόγραμμα στη γλώσσα προγραμματισμού C, το οποίο για δεδομένο
 * μονοδιάστατο πίνακα ακεραίων 12 θέσεων να τον περιστρέφει ως προς το μεσαίο στοιχείο και
 * εν συνεχεία να τον τυπώνει. Για παράδειγμα τον πίνακα {1,3,6,8,9,14,18,20,22,25,27,30} να
 * τον περιστρέφει σε {18,20,22,25,27,30,1,3,6,8,9,14} και τον τυπώνει
 * στη μορφή 18 20 22 25 27 30 1 3 6 8 9 14.
 *
 */

#include <stdio.h>

// Το μέγεθος του πίνακα
#define N 12

int main()
{
    // Ο αρχικός πίνακας με τις αρχικές τιμές του
    int oldArray[N] = {1,3,6,8,9,14,18,20,22,25,27,30};
    int newArray[N]; // Ο νέος πίνακας
    int arrayHalf; // Το μέσο του πίνακα
    int i; // Μετρητής

    // Υπολογίζουμε το μεσο του πίνακα
    arrayHalf = N / 2;

    // Σαρώνουμε όλες τις τιμές του oldArray
    for (i=0; i<N; i++) {
        // Αν η θέση του στοιχείου είναι αριστερά από το μέσο
        if (i < arrayHalf) {
            // Αντιγράφουμε την τιμή στα δεξιά του μέσου του νέου πίνακα
            newArray[i+arrayHalf] = oldArray[i];
        } else { // Αν η θέση του στοιχείου είναι δεξιά από το μέσο
            // Αντιγράφουμε την τιμή στα αριστερά του μέσου του νέου πίνακα
            newArray[i-arrayHalf] = oldArray[i];
        }
    }

    // Τυπώνουμε τον νέο πίνακα
    for (i=0; i<N; i++) {
        printf("%d ", newArray[i]);
    }

    return 0;
}