/**
 *
 * File: kyranis_2B.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 23/1/2019
 * Time: 2:50 πμ
 *
 * ΥΠΟΕΡΓΑΣΙΑ 2Β
 *
 * Να γραφεί πρόγραμμα στη γλώσσα προγραμματισμού C, το οποίο να διαβάζει διαδοχικά 3
 * ακεραίους αριθμούς και να τους εισάγει σε μια απλά συνδεδεμένη λίστα. Να χρησιμοποιηθεί
 * αμυντικός προγραμματισμός ώστε ο πρώτος αριθμός να είναι στο διάστημα [-10,10], ενώ κάθε
 * επόμενος σε διάστημα ±10 από τον προηγούμενό του (π.χ. αν ο πρώτος αριθμός δοθεί 7, τότε ο
 * δεύτερος πρέπει να είναι στο διάστημα [-3,17]. Αν αντίστοιχα ο δεύτερος δοθεί -2, τότε ο τρίτος
 * πρέπει να είναι στο διάστημα [-12,8]). Στο τέλος να διατρέχει τη λίστα και να εκτυπώνει την
 * τιμή κάθε κόμβου, καθώς και το πλήθος των κόμβων με θετική τιμή.
 *
 */

#include <stdio.h>

#define numbers 3 // Το πλήθος των αριθμών που ζητάει το πρόγραμμα
#define range 10  // Το διάστημα από τον προηγούμενο αριθμό

int main()
{
    int i; // Μετρητής
    int number; // Αριθμός που εισάγει ο χρήστης
    int startRange, endRange; // Αρχή και τέλους διαστήματος που πρέπει να ανήκει ο αριθμός

    number = 0; // Μηδενισμός του αριθμού για να υπολογίσει το αρχικό διάστημα επιτρεπτών αριθμών

    // Εισαγωγή δεδομένων για numbers αριθμούς, με αμυντικό προγραμματισμό
    for(i=0; i<numbers; i++) {

        // Υπολογισμός της αρχής και τέλους του διαστήματος που ανήκει ο επόμενος αριθμός
        startRange = number - range;
        endRange = number + range;

        do {
            printf("\nΕισάγετε την τιμή του %dου κόμβου: [%d,%d]", i+1, startRange, endRange);
            scanf("%d", &number);

            if (number<startRange || number>endRange) {
                printf("\nΛάθος τιμή! Η τιμή πρέπει να είναι στο διάστημα: [%d,%d]", startRange, endRange);
            }
        } while (number<startRange || number>endRange);
    }


}
