/**
 *
 * File: kyranis_2C.c
 *
 * Created by Yiannis Kiranis <std138327@ac.eap.gr>
 *
 * Date: 23/1/2019
 * Time: 2:49 πμ
 *
 * Σε ένα αγώνα άλμα εις μήκος συμμετέχουν 8 αθλητές. Να γραφεί πρόγραμμα στη γλώσσα
 * προγραμματισμού C, το οποίο να διαβάζει τον αριθμό φανέλας (ακέραιος, υποχρεωτικά στο
 * διάστημα 100-999) και την καλύτερη επίδοση (πραγματικός, υποχρεωτικά στο διάστημα 0.0-
 * 9.9) για όλους τους αθλητές, και στην συνέχεια να εμφανίζει την λίστα κατάταξης (δηλαδή
 * αριθμό και καλύτερη επίδοση ταξινομημένα σε φθίνουσα ταξινόμηση ως προς την επίδοση).
 * Για την αποθήκευση των δεδομένων να χρησιμοποιηθούν πίνακες, ενώ για την ταξινόμηση η
 * μέθοδος της φυσαλίδας. Για απλοποίηση της λύσης, δεν χρειάζεται να ελέγχεται με αμυντικό
 * προγραμματισμό αν δύο ή περισσότεροι αθλητές έχουν τον ίδιο αριθμό φανέλας.
 *
 */

#include <stdio.h>

// Το σύνολο των αθλητών
#define ATHLETES 8

int main()
{
    int athleteNumbers[ATHLETES]; // Ο πίνακας με τα νούμερα φανέλας των αθλητών
    float jumps[ATHLETES]; // Ο πίνακας με τις επιδόσεις
    int i,j; // Μετρητές
    // Προσωρινές μεταβλητές για ανταλλαγή τιμών
    float tempJump;
    int tempNumber;

    // Εισαγωγή δεδομένων για όλους τους αθλητές, με αμυντικό προγραμματισμό
    for (i=0; i<ATHLETES; i++) {
        do {
            printf("Δώσε αριθμό φανέλας για τον αθλητή %d: ", i+1);
            scanf("%d", &athleteNumbers[i]);

            if (athleteNumbers[i]<100 || athleteNumbers[i]>999) {
                printf("Ο αριθμός πρέπει να είναι μεταξύ 100-999\n");
            }
        } while (athleteNumbers[i]<100 || athleteNumbers[i]>999);

        do {
            printf("Δώσε επίδοση για τον αθλητή %d: ", i+1);
            scanf("%f", &jumps[i]);

            if (jumps[i]<0.0 || jumps[i]>9.9) {
                printf("Η επίδοση πρέπει να είναι μεταξύ 0.0-9.9\n");
            }
        } while (jumps[i]<0.0 || jumps[i]>9.9);
    }

    // Ταξινόμηση (σε φθίνουσα) των 2 πινάκων με βάση τις επιδόσεις, με την μέθοδο της φυσσαλίδας
    for (i=0; i<ATHLETES-1; i++) {
        for (j=ATHLETES-1; j>=i+1; j--) {
            if (jumps[j]>jumps[j-1]) {
                tempJump = jumps[j-1];
                jumps[j-1] = jumps[j];
                jumps[j] = tempJump;

                tempNumber = athleteNumbers[j-1];
                athleteNumbers[j-1] = athleteNumbers[j];
                athleteNumbers[j] = tempNumber;
            }
        }
    }

    // Εμφάνιση των αποτελεσμάτων
    printf("Αρ. φανέλας\tΕπίδοση\n");

    for (i=0; i<ATHLETES; i++) {
        printf("%d \t\t %2.1f\n", athleteNumbers[i], jumps[i]);
    }

    return 0;
}
